Дошкольное_учреждение83/src/Catalogs/удуУчреждения/удуУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуУчреждения</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВышестоящийОрган</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганУправления</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчреждения</name>
    <type>
      <types>EnumRef.удуВидыДошкольногоУчреждения</types>
      <types>EnumRef.удуВидыОбщеобразовательногоУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджетополучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОрганаФК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОрганаФК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКОГУ</name>
    <type>
      <types>CatalogRef.удуОКОГУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКВЭД</name>
    <type>
      <types>CatalogRef.удуОКВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКФС</name>
    <type>
      <types>CatalogRef.удуОКФС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>CatalogRef.удуОКОПФ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрировавшийОрган</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаКадровогоСостава</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУченыхСтепеней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПравительственныхНаград</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтраслевыхНаград</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПочетныхЗваний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПРОО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПрошедшихКПК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныУчреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СайтУчреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочтаУчреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыДОУ</name>
    <type>
      <types>EnumRef.удуРежимРаботыДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаходитсяНаКапитальномРемонте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПрофиляУчреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУчреждения</name>
    <type>
      <types>EnumRef.удуТипУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизационнаяСтруктура</name>
    <type>
      <types>EnumRef.удуОрганизационнаяСтруктура</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.удуСчетаУчреждения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуТипУчреждения/удуТипУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуТипУчреждения</name>
  <enumValues>
    <name>ДОУ</name>
  </enumValues>
  <enumValues>
    <name>ОУ</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуУчреждения/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ОтработатьИзменениеТипаНаСервере()
	Если Объект.ТипУчреждения = Перечисления.удуТипУчреждения.ДОУ Тогда
		Объект.ВидУчреждения = Перечисления.удуВидыДошкольногоУчреждения.ПустаяСсылка();
	Иначе
		Объект.ВидУчреждения = Перечисления.удуВидыОбщеобразовательногоУчреждения.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	// Сведения о лицензировании.
	ЭлементОтбораПоУчреждениюЛицензия = РеквизитСведенияОЛицензировании.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУчреждениюЛицензия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУчреждениюЛицензия.Использование = Истина;
	ЭлементОтбораПоУчреждениюЛицензия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учреждение");
	ЭлементОтбораПоУчреждениюЛицензия.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУчреждениюЛицензия.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	// Сведения об аккредитации.
	ЭлементОтбораПоУчреждениюАккредитация = РеквизитСведенияОбАккредитации.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУчреждениюАккредитация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУчреждениюАккредитация.Использование = Истина;
	ЭлементОтбораПоУчреждениюАккредитация.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учреждение");
	ЭлементОтбораПоУчреждениюАккредитация.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУчреждениюАккредитация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	// Сведения об аккредитованных образовательных программах.
	ЭлементОтбораПоУчреждениюОбразовательныеПрограммы = РеквизитСведенияОбОбразовательныхПрограммах.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУчреждениюОбразовательныеПрограммы.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУчреждениюОбразовательныеПрограммы.Использование = Истина;
	ЭлементОтбораПоУчреждениюОбразовательныеПрограммы.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учреждение");
	ЭлементОтбораПоУчреждениюОбразовательныеПрограммы.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУчреждениюОбразовательныеПрограммы.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	
	// Сведения о реализуемых программах, проектах.
	ЭлементОтбораПоУчреждениюРеализуемыеПрограммы = РеквизитСведенияОРеализуемыхПрограммах.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУчреждениюРеализуемыеПрограммы.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУчреждениюРеализуемыеПрограммы.Использование = Истина;
	ЭлементОтбораПоУчреждениюРеализуемыеПрограммы.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учреждение");
	ЭлементОтбораПоУчреждениюРеализуемыеПрограммы.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУчреждениюРеализуемыеПрограммы.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	// Сведения о социальных программах, проектах.
	ЭлементОтбораПоУчреждениюСоциальныеПрограммы = РеквизитСведенияОСоциальныхПрограммах.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУчреждениюСоциальныеПрограммы.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУчреждениюСоциальныеПрограммы.Использование = Истина;
	ЭлементОтбораПоУчреждениюСоциальныеПрограммы.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учреждение");
	ЭлементОтбораПоУчреждениюСоциальныеПрограммы.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУчреждениюСоциальныеПрограммы.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;	
	
	// Сведения о направлениях доп.образования.
	ЭлементОтбораПоУчреждениюНаправления = РеквизитСведенияОНаправлениях.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораПоУчреждениюНаправления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораПоУчреждениюНаправления.Использование = Истина;
	ЭлементОтбораПоУчреждениюНаправления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учреждение");
	ЭлементОтбораПоУчреждениюНаправления.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбораПоУчреждениюНаправления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	
	ЭтаФорма.Элементы.ГруппаОбразовательнаяДеятельность.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	ЭтаФорма.Элементы.ГруппаРегистрационныеДанные.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	ЭтаФорма.Элементы.ГруппаПрограммыПроекты.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
	// Обработчик подсистемы "Контактная информация".
	СписокГруппФормы = Новый СписокЗначений;
	СписокГруппФормы.Добавить("Адрес", "ГруппаАдреса");
	СписокГруппФормы.Добавить("Телефон", "ГруппаТелефоны");
	СписокГруппФормы.Добавить("Сайт", "ГруппаМэйлСайт");
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаКонтактнаяИнформация", СписокГруппФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактироватьКлассификатор(Команда)
	Перем РеквизитБылИзменен;
	
	ТекущееЗначениеКлассификатора = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, "КнопкаРедактировать", "");	
	ВыбранноеЗначениеКлассификатора = ОткрытьФормуМодально("Справочник.уду" + ТекущееЗначениеКлассификатора + ".ФормаВыбора");
	
	Если ВыбранноеЗначениеКлассификатора = Неопределено Тогда
		Возврат;
	Иначе
		Выполнить("РеквизитБылИзменен = Булево(ВыбранноеЗначениеКлассификатора <> Объект." + ТекущееЗначениеКлассификатора + ");");
		Если РеквизитБылИзменен Тогда
			Выполнить("Объект." + ТекущееЗначениеКлассификатора + " = ВыбранноеЗначениеКлассификатора;");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Сведения о лицензировании.
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОЛицензировании.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Учреждение" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	// Сведения об аккредитации.
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОбАккредитации.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Учреждение" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	// Сведения об аккредитованных образовательных программах.
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОбОбразовательныхПрограммах.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Учреждение" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;	
	
	// Сведения о реализуемых программах, проектах.
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОРеализуемыхПрограммах.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Учреждение" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	// Сведения о социальных программах, проектах
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОСоциальныхПрограммах.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Учреждение" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;	
	
	// Сведения о направлениях доп.образования.
	Для Каждого СтрокаЭлемент Из РеквизитСведенияОНаправлениях.Отбор.Элементы Цикл
		Если Строка(СтрокаЭлемент.ЛевоеЗначение) = "Учреждение" Тогда
			СтрокаЭлемент.ПравоеЗначение = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Элементы.ГруппаОбразовательнаяДеятельность.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	ЭтаФорма.Элементы.ГруппаРегистрационныеДанные.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	ЭтаФорма.Элементы.ГруппаПрограммыПроекты.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
	// Сделаем данное учреждение основным (если таковое отсутствует).
	Если Не ЗначениеЗаполнено(Константы.удуОсновноеУчреждение.Получить()) Тогда
		Константы.удуОсновноеУчреждение.Установить(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик подсистемы "Контактная информация".
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);		
КонецПроцедуры

&НаКлиенте
Процедура ТипУчрежденияПриИзменении(Элемент)
	ОтработатьИзменениеТипаНаСервере();	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "КОНТАКТНАЯ ИНФОРМАЦИЯ"

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)	
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры
